{
	"showSidebar": true,
	"sidebar": {
		"text": "These days, I am developing with a wide array of technologies across the full stack.",
		"legend": [
			{
				"class": "client-side",
				"label": "Client Side"
			},
			{
				"class": "server-side",
				"label": "API / Server Side"
			},
			{
				"class": "data-processing",
				"label": "Data Processing"
			}
		]
	},
	"content": {
		"title": "Tech Stack",
		"class": "techStack",
		"subtitle": "I have a diversified tech stack",
		"elements": [
			{
				"stack": "client-side",
				"name": "javascript",
				"benefit": "I grew up on the web... And Javascript is the language of the web. So, I basically speak Javascript.",
				"icon": "js.png"
			},
			{
				"stack": "client-side",
				"name": "backbone",
				"benefit": "Disorganized code is disgusting. So, to keep my front-end code DRY, maintainable, and scalable, I prefer using Backbone.",
				"icon": "backbone.png"
			},
			{
				"stack": "client-side",
				"name": "html5",
				"benefit": "While I enjoy building native apps, I prefer to build apps that run everywhere. That's why HTML5 is an important part of my tech stack.",
				"icon": "html5.png"
			},
			{
				"stack": "client-side",
				"name": "css3",
				"benefit": "While I lack the skills of visual design, CSS enables me to express my creativity. I use CSS to augment the experiences I create for users.",
				"icon": "css3.png"
			},
			{
				"stack": "client-side",
				"name": "d3",
				"benefit": "To gain insights from data, that data must be visualized. D3 is awesome at this and plays an important role in my tech stack for data products.",
				"icon": "d3.png"
			},
			{
				"stack": "server-side",
				"name": "nodejs",
				"benefit": "Asynchronous, server-side Javascript is a game-changer! With Node, I can develop across the full stack!",
				"icon": "nodejs.png"
			},
			{
				"stack": "server-side",
				"name": "expressjs",
				"benefit": "Using Express to build RESTful APIs is amazing. I mostly use Express as a corner piece for building modern scalable web-services.",
				"icon": "expressjs.png"
			},
			{
				"stack": "server-side",
				"name": "mongo",
				"benefit": "Along with Node and Express, Mongo completes my server-side tech stack as my preferred data store.",
				"icon": "mongodb.png"
			},
			{
				"stack": "data-processing",
				"name": "r",
				"benefit": "I don't always need to process data. But, when I do, I prefer to use R! It's also great for prototyping data products.",
				"icon": "r.png"
			},
			{
				"stack": "data-processing",
				"name": "javascript",
				"benefit": "I like using Javascript for data manipulation, too, though balancing processing responsibility between client and server is tricky!",
				"icon": "js.png"
			}
		]
	}
}
